rbafna6507/cartpole_inverted_pendulum/cartpole_esp32/cartpole_esp32.ino
// ============================================================================
//  cartpole_esp32.ino   -- v2, built around the actual hardware
//
//  PARTS
//    encoder : AS5600 module (12-bit, I2C, 3.3V, 23x23mm)
//    drivers : 3x SparkFun Big Easy Driver (A4988, Rs = 0.11 ohm)
//    cart    : NEMA 17 + GT2 belt
//    height  : 2x SFU1605 ball screw stage (5 mm lead) + NEMA 17
//
//  HARDWARE PREREQUISITES - do these before flashing
//    1. Solder the 3/5V jumper CLOSED on all three Big Easy Drivers.
//       The A4988 needs Vih >= 0.7*VDD. At 5V logic that is 3.5V, and the
//       ESP32 only drives 3.3V. Without the jumper you get intermittent
//       missed steps that look exactly like a controller tuning problem.
//    2. Set driver current with the pot: I = Vref / (8 * 0.11) = Vref / 0.88.
//       The ball-screw motors are 1.5A -> Vref = 1.32V. Measure at TP1 with
//       the motor unplugged.
//    3. Tie the AS5600 module's DIR pin to GND. Floating = undefined count
//       direction.
//    4. 24V on M+ (not the VCC pin - that is an output). The 60T cart uses
//       120 mm of belt travel per motor revolution.
//
//  PINOUT
//    25 cart STEP    26 cart DIR
//    16 Z1   STEP    17 Z1   DIR
//    18 Z2   STEP    19 Z2   DIR
//    27 ENABLE for ALL THREE drivers (active low)
//    21 SDA          22 SCL          AS5600 on 3V3, DIR pin -> GND
//    MS1/MS2/MS3 are left UNCONNECTED on all three drivers. The BED pulls
//    them high, which is its 1/16 default: 26.667 steps/mm on a 60T GT2 belt,
//    640 steps/mm on a 5 mm ball-screw lead.
//
//  WHY ACCELERATION IS THE CONTROL INPUT
//    A stepper is a kinematic actuator - you command position, not force. So
//    the plant reduces to
//        theta_ddot = ( g*sin(theta) - a*cos(theta) ) / L_EFF
//        x_ddot     = a
//    with theta measured from UPRIGHT and L_EFF = I_pivot/(m*r_com). Cart
//    mass, belt friction and motor torque never enter the model, as long as
//    you don't lose steps.
//
//  IMPORTANT: ball screws back-drive
//    SFU1605 is efficient enough to back-drive under load. Since all three
//    ENABLE lines share GPIO27, de-energizing to stop would drop the rail.
//    So 'stop' zeroes all velocities but KEEPS the motors energized. 'off'
//    de-energizes and is a separate, deliberate command.
//
//  PROTOCOL (921600 baud, newline terminated). See cartpole.py for the host.
//    host -> board                      board -> host
//      auto            swing-up           T <ms> <mode> <th> <thd> <x> <v>
//      bal             balance only         <a> <e> <z1> <z2> <agc> <dt_us>
//      manual          manual drive       = <key> <value>
//      v <m/s>         cart velocity      # <human readable log>
//      zv <mm/s>       both screws        ! <error>
//      zstop
//      stop            e-stop, stay energized
//      off / on        de-energize / energize
//      home            call this x = 0
//      zhome           call this z = 0
//      zero            re-zero encoder (pendulum hanging, still)
//      rate <hz>       telemetry rate, 0 = off
//      set <k> <v>     live-tune a parameter
//      get <k> / params / stat / help
// ============================================================================

#include <Arduino.h>
#include <Wire.h>
#include "soc/soc.h"        // REG_WRITE
#include "soc/gpio_reg.h"   // GPIO_OUT_W1TS_REG / GPIO_OUT_W1TC_REG

// ============================== PINS ========================================
#define PIN_CART_STEP   25
#define PIN_CART_DIR    26
#define PIN_Z1_STEP     16
#define PIN_Z1_DIR      17
#define PIN_Z2_STEP     18
#define PIN_Z2_DIR      19
#define PIN_EN_ALL      27        // shared ENABLE, active LOW
#define PIN_SDA         21
#define PIN_SCL         22
#define I2C_HZ          400000    // drop to 100000 if the cable to the cart is
                                  // long or you see enc_err climbing

#define CART_INVERT     1         // flip if 'v 0.05' moves the cart the wrong way
#define Z_INVERT        0         // flip if 'zv 5' lowers instead of raises
#define ENC_INVERT      0         // flip if theta goes negative when the pole
                                  // leans toward +x

// ========================== MECHANICS =======================================
// Big Easy Driver floating MS pins select 1/16: 3200 steps/rev.
// 60T GT2 gives 120 mm/rev and 26.667 steps/mm.
#define CART_MICROSTEPS 16        // MS pins floating -> BED default
#define Z_MICROSTEPS    16        // same
#define MOTOR_STEPS_REV 200       // 1.8 deg
#define PULLEY_TEETH    60        // GT2 60T
#define BELT_PITCH_MM   2.0f
#define Z_LEAD_MM       5.0f      // SFU1605

static const float CART_STEPS_PER_M =
    (MOTOR_STEPS_REV * CART_MICROSTEPS) / (PULLEY_TEETH * BELT_PITCH_MM * 1e-3f);
static const float Z_STEPS_PER_MM =
    (MOTOR_STEPS_REV * Z_MICROSTEPS) / Z_LEAD_MM;

#define GRAV            9.81f
#define CTRL_HZ         1000
// The A4988 needs >=1 us of STEP high AND >=1 us low, so the DDS spends one
// timer tick high and at least one low: max step rate is ISR_HZ/2.
//   80 kHz -> 40 k steps/s -> 1.50 m/s ->  750 rpm
//  120 kHz -> 60 k steps/s -> 2.25 m/s -> 1125 rpm
//  150 kHz -> 75 k steps/s -> 2.81 m/s -> 1406 rpm
// 120 kHz is an 8.3 us period and the ISR costs ~1.5 us, so roughly 18% of one
// core. This is the aggressive setting. If serial drops characters, the board
// resets, or 'stat' shows loop time climbing past ~250 us, back off to 80000.
// The motor itself holds torque to around 1200-1500 rpm on 24V, so past about
// 150 kHz you stop gaining anything real.
#define ISR_HZ          120000    // 3-channel step DDS; max rate = ISR_HZ/2
static const float DT = 1.0f / CTRL_HZ;

// Hard ceiling on cart speed, derived rather than guessed. Ask for more than
// this and the pulse generator clamps while the controller keeps believing the
// number it was given - so we clamp loudly at the point of entry instead.
static const float VMAX_CEIL = (ISR_HZ * 0.5f) / CART_STEPS_PER_M;

#define MANUAL_TIMEOUT_MS 250     // 'v' command watchdog: no news = stop

// ===================== LIVE-TUNABLE PARAMETERS ==============================
// Change any of these at runtime with  set <name> <value>  - no reflash.
float p_leff    = 0.20f;   // effective pendulum length, m  (see CALIBRATION)
float p_pw      = 7.07f;   // desired pendulum pole pair: natural freq, rad/s
float p_pz      = 0.707f;  //   ... and damping
float p_pc1     = -1.2f;   // desired cart poles, rad/s (negative)
float p_pc2     = -1.6f;
// SPEED PROFILE: the defaults below are the deliberately-crawling bring-up
// values, so the first power-up cannot hurt anything. Send 'fast' to switch to
// the values the controller actually needs, 'slow' to come back. A cart-pole
// physically cannot balance on the slow profile - the cart has to be able to
// accelerate under a falling pole, and 1 m/s^2 is nowhere near enough. Slow is
// for checking directions, distances and wiring, nothing more.
float p_vmax    = 0.05f;   // m/s - hard ceiling is ISR_HZ/2/steps_per_m = 2.25
float p_amax_s  = 0.5f;    // m/s^2 during swing-up
float p_amax_b  = 1.0f;    // m/s^2 while balancing
float p_ke      = 0.25f;   // energy pump gain
float p_kpx     = 15.0f;   // cart centring during swing-up
float p_kdx     = 6.0f;
float p_catch_a = 0.30f;   // rad  - hand off to the balancer inside this
float p_catch_r = 5.0f;    // rad/s
float p_giveup  = 0.55f;   // rad  - balancer gives up outside this
float p_rail    = 0.22f;   // m, centre to each physical end
float p_bw      = 20.0f;   // Hz, angle/rate estimator bandwidth
float p_vman    = 0.02f;   // m/s, manual jog speed
float p_zvmax   = 2.0f;    // mm/s
float p_zamax   = 20.0f;   // mm/s^2
float p_ztravel = 100.0f;  // mm of usable screw travel above z=0

// state-feedback gains, computed from the poles above: a = -(K.[th,thd,x,v])
float K1, K2, K3, K4;

