rbafna6507/cartpole_inverted_pendulum/cartpole_esp32/cartpole_esp32.ino
struct Param { const char *name; float *ptr; bool recalc; };
static const Param PARAMS[] = {
  {"leff",&p_leff,true},   {"pw",&p_pw,true},      {"pz",&p_pz,true},
  {"pc1",&p_pc1,true},     {"pc2",&p_pc2,true},
  {"vmax",&p_vmax,false},  {"amax_s",&p_amax_s,false},{"amax_b",&p_amax_b,false},
  {"ke",&p_ke,false},      {"kpx",&p_kpx,false},   {"kdx",&p_kdx,false},
  {"catch_a",&p_catch_a,false},{"catch_r",&p_catch_r,false},
  {"giveup",&p_giveup,false},{"rail",&p_rail,false},{"bw",&p_bw,false},
  {"vman",&p_vman,false},  {"zvmax",&p_zvmax,false},{"zamax",&p_zamax,false},
  {"ztravel",&p_ztravel,false},
  {"k1",&K1,false}, {"k2",&K2,false}, {"k3",&K3,false}, {"k4",&K4,false},
};
static const int N_PARAMS = sizeof(PARAMS)/sizeof(PARAMS[0]);

// ==================== STEP PULSE GENERATOR (3 axes) =========================
// Direct digital synthesis: a 32-bit phase accumulator per axis, ticked at
// ISR_HZ. Accumulator overflow == one step. Exact average rate, exact step
// count, no drift. No floating point in the ISR - the ESP32 FPU is not safe
// to touch from an interrupt under FreeRTOS.

enum { AX_CART = 0, AX_Z1, AX_Z2, N_AX };

DRAM_ATTR static const uint32_t AX_MASK[N_AX] = {
  (1UL << PIN_CART_STEP), (1UL << PIN_Z1_STEP), (1UL << PIN_Z2_STEP)
};
DRAM_ATTR static const uint32_t ALL_STEP_MASK =
  (1UL<<PIN_CART_STEP) | (1UL<<PIN_Z1_STEP) | (1UL<<PIN_Z2_STEP);

volatile uint32_t ax_inc[N_AX] = {0,0,0};
volatile int32_t  ax_pos[N_AX] = {0,0,0};
volatile int8_t   ax_dir[N_AX] = {1,1,1};
DRAM_ATTR static uint32_t ax_acc[N_AX] = {0,0,0};

hw_timer_t *g_timer = nullptr;

// W1TS / W1TC are "write 1 to set" / "write 1 to clear" registers: writing a
// mask flips exactly those pins and leaves every other pin alone, with no
// read-modify-write and no chance of racing the main loop over a shared port.
// That is why all three STEP pins must live in GPIO 0-31 - pins 32+ are a
// different register pair (GPIO_OUT1_W1TS_REG).
void IRAM_ATTR onStepTimer() {
  REG_WRITE(GPIO_OUT_W1TC_REG, ALL_STEP_MASK);   // end pulses started last tick
  uint32_t set = 0;
  for (int i = 0; i < N_AX; i++) {
    uint32_t inc = ax_inc[i];
    if (!inc) continue;
    uint32_t prev = ax_acc[i];
    ax_acc[i] = prev + inc;
    if (ax_acc[i] < prev) { ax_pos[i] += ax_dir[i]; set |= AX_MASK[i]; }
  }
  if (set) REG_WRITE(GPIO_OUT_W1TS_REG, set);
}

static const uint8_t DIR_PIN[N_AX] = { PIN_CART_DIR, PIN_Z1_DIR, PIN_Z2_DIR };

void axSetRate(int i, float steps_per_sec, bool invert) {
  int8_t d = (steps_per_sec >= 0.0f) ? 1 : -1;
  if (d != ax_dir[i]) {
    ax_dir[i] = d;
    bool high = (d > 0);
    if (invert) high = !high;
    digitalWrite(DIR_PIN[i], high ? HIGH : LOW);
  }
  float r = fabsf(steps_per_sec);
  const float RMAX = ISR_HZ * 0.5f;
  if (r > RMAX) r = RMAX;
  ax_inc[i] = (uint32_t)((double)r * 4294967296.0 / (double)ISR_HZ);
}

void steppersInit() {
  const uint8_t outs[] = { PIN_CART_STEP, PIN_CART_DIR, PIN_Z1_STEP, PIN_Z1_DIR,
                           PIN_Z2_STEP, PIN_Z2_DIR };
  for (uint8_t p : outs) { pinMode(p, OUTPUT); digitalWrite(p, LOW); }
  pinMode(PIN_EN_ALL, OUTPUT); digitalWrite(PIN_EN_ALL, HIGH);   // de-energized

  // Microstepping is whatever the drivers default to (1/16). MS1/MS2/MS3 are
  // deliberately not touched, so GPIO 32 / 33 / 13 are free for limit
  // switches or anything else you add later.

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  g_timer = timerBegin(1000000);
  timerAttachInterrupt(g_timer, &onStepTimer);
  timerAlarm(g_timer, 1000000UL / ISR_HZ, true, 0);
#else
  g_timer = timerBegin(0, 80, true);
  timerAttachInterrupt(g_timer, &onStepTimer, true);
  timerAlarmWrite(g_timer, 1000000UL / ISR_HZ, true);
  timerAlarmEnable(g_timer);
#endif
}

bool g_energized = false;
void energize(bool on) {
  g_energized = on;
  digitalWrite(PIN_EN_ALL, on ? LOW : HIGH);
}

// ============================== AS5600 ======================================
#define AS5600_ADDR   0x36
#define REG_STATUS    0x0B
#define REG_RAWANGLE  0x0C
#define REG_CONF_HI   0x07
#define REG_AGC       0x1A
#define ENC_CPR       4096

static int32_t enc_last_raw = 0, enc_ticks = 0, enc_zero = 0;
volatile uint8_t enc_agc = 0;
volatile uint8_t enc_status = 0;
volatile uint32_t enc_errors = 0;

bool as5600Write8(uint8_t reg, uint8_t val) {
  Wire.beginTransmission(AS5600_ADDR);
  Wire.write(reg); Wire.write(val);
  return Wire.endTransmission() == 0;
}
int16_t as5600Read8(uint8_t reg) {
  Wire.beginTransmission(AS5600_ADDR);
  Wire.write(reg);
  if (Wire.endTransmission(false) != 0) return -1;
  if (Wire.requestFrom((uint8_t)AS5600_ADDR,(uint8_t)1) != 1) return -1;
  return Wire.read();
}

// The single most important line in this file for control performance:
// the AS5600's Slow Filter defaults to 16x, which is 2.2 ms of propagation
// delay. That is pure phase lag in a 1 kHz balance loop and it hard-caps how
// stiff you can make the controller. SF=2x drops it to 0.286 ms. Costs a
// little LSB noise, which the estimator cleans up anyway. CONF is volatile,
// so this has to be rewritten every boot.
//   CONF high byte: [--][WD][FTH2:0][SF1:0]
//   SF: 00=16x(2.2ms) 01=8x(1.1ms) 10=4x(0.55ms) 11=2x(0.286ms)
//   FTH=000 -> slow filter only
bool as5600FastFilter() {
  bool ok  = as5600Write8(REG_CONF_HI, 0b00000011);   // FTH=000, SF=2x
  ok &= as5600Write8(REG_CONF_HI + 1, 0b00000000);    // PM=NOM, HYST off
  return ok;
}

// ---------------------------------------------------------------------------
//  SINGLE-OWNER I2C RULE
//  Everything from here down touches Wire, and exactly one context may do so:
//  setup() owns the bus before the control task exists, the control task owns
//  it exclusively afterwards. loop() must NEVER touch Wire - serial commands
//  set request flags and read cached values instead.
//
//  Why: Arduino's TwoWire takes its lock inside beginTransmission and drops it
//  at endTransmission. A register read is endTransmission(false) followed by a
//  separate requestFrom, so the lock is released in the middle of a repeated
//  start. A second caller slips into that gap and both transactions come back
//  garbage or NACK. That is precisely why 'mag' failed here while the
//  single-threaded scanner sketch read the same encoder fine.
// ---------------------------------------------------------------------------

volatile bool     enc_ok = false;
volatile uint32_t enc_recoveries = 0;
static   uint32_t enc_consec_err = 0;

void encBusReinit() {
  Wire.end();
  delay(2);
  Wire.begin(PIN_SDA, PIN_SCL, I2C_HZ);
  Wire.setTimeOut(50);
  as5600FastFilter();          // CONF is volatile, re-apply after a re-init
  enc_recoveries++;
}

int32_t encReadRaw() {
  Wire.beginTransmission(AS5600_ADDR);
  Wire.write(REG_RAWANGLE);
  if (Wire.endTransmission(false) != 0) { enc_errors++; return -1; }
  if (Wire.requestFrom((uint8_t)AS5600_ADDR,(uint8_t)2) != 2) { enc_errors++; return -1; }
  uint16_t hi = Wire.read(), lo = Wire.read();
  return ((hi << 8) | lo) & 0x0FFF;
}

void encUpdate() {
  int32_t raw = encReadRaw();
  if (raw < 0) {
    // Hold the last value through a one-off glitch, but a sustained run of
    // failures means the bus is wedged (a stretched clock, a brown-out on the
    // module). Rebuild it rather than running the controller blind.
    if (++enc_consec_err >= 50) { enc_consec_err = 0; encBusReinit(); }
    enc_ok = false;
    return;
  }
  enc_consec_err = 0;
  enc_ok = true;
  int32_t d = raw - enc_last_raw;
  if (d >  ENC_CPR/2) d -= ENC_CPR;
  if (d < -ENC_CPR/2) d += ENC_CPR;
  enc_ticks += d;
  enc_last_raw = raw;
}

inline float wrapPi(float a) {
  while (a >  (float)M_PI) a -= 2.0f*(float)M_PI;
  while (a < -(float)M_PI) a += 2.0f*(float)M_PI;
  return a;
}

// theta: 0 = upright, +-pi = hanging, positive = pole top leaning toward +x
float encTheta() {
  float a = (enc_ticks - enc_zero) * (2.0f*(float)M_PI / (float)ENC_CPR);
#if ENC_INVERT
  a = -a;
#endif
  return wrapPi(a + (float)M_PI);
}

// Magnet diagnostics. The reviews on these modules are full of people who got
// the wrong magnet - check this before blaming the controller.
//   STATUS bit5 MD = detected, bit4 ML = too weak, bit3 MH = too strong
//   AGC should sit mid-range (~64 of 0..128 at 3.3V). Railed = bad air gap.
// Bus access - control task (or setup) only.
void encDiagRead() {
  int16_t st = as5600Read8(REG_STATUS);
  int16_t ag = as5600Read8(REG_AGC);
  if (st >= 0) enc_status = st;
  if (ag >= 0) enc_agc = ag;
}

// Printing only - safe from loop(), reads the cached copies.
void encPrintMagnet() {
  uint8_t st = enc_status, ag = enc_agc;
  if (!enc_ok) Serial.println(F("! encoder not reading - values below are stale"));
  Serial.printf("# AS5600 status=0x%02X agc=%d  %s%s%s\n", st, ag,
                (st & 0x20) ? "magnet-ok " : "NO-MAGNET ",
                (st & 0x10) ? "too-weak "  : "",
                (st & 0x08) ? "too-strong" : "");
  if (ag >= 120)     Serial.println(F("# AGC at max gain - magnet too far, move it CLOSER"));
  else if (ag <= 8)  Serial.println(F("# AGC at min gain - magnet too close"));
  Serial.printf("# i2c errors=%lu  bus recoveries=%lu\n",
                (unsigned long)enc_errors, (unsigned long)enc_recoveries);
}

// Blocking version - setup() only, before the control task exists.
void encZeroBlocking() {
  Serial.println(F("# zeroing: hold the pendulum still, hanging down..."));
  int stable = 0; int32_t prev = enc_ticks; uint32_t t0 = millis();
  while (stable < 400 && millis() - t0 < 15000) {
    encUpdate();
    if (labs(enc_ticks - prev) <= 2) stable++; else stable = 0;
    prev = enc_ticks;
    delay(2);
  }
  enc_zero = enc_ticks;
  Serial.printf("# encoder zeroed, theta = %.3f rad\n", encTheta());
}

// ========================== CONTROLLER ======================================
enum Mode { M_IDLE=0, M_MANUAL, M_SWINGUP, M_BALANCE, M_FAULT };
volatile Mode mode = M_IDLE;
const char *MODE_NAME[] = {"IDLE","MANUAL","SWINGUP","BALANCE","FAULT"};

volatile float th=0, thd=0, xc=0, vc=0, acc_cmd=0, energy_n=-1;
volatile float z_mm=0;
volatile uint32_t loop_us=0;
static float th_hat=0, thd_hat=0;
static int   swing_sign=1;
static uint32_t stall_ms=0;
static int32_t home_steps=0, zhome_steps=0;

// Cross-context requests. loop() may only SET these; the control task is the
// only thing allowed to act on them, because it is the sole owner of the I2C
// bus once it exists. This is the whole fix for 'mag' returning nothing.
volatile bool req_diag = false, req_zero = false;
volatile bool diag_done = false, zero_done = false;
static bool zeroing = false;
static int  zero_stable = 0;
static int32_t zero_prev = 0;
static uint32_t zero_t0 = 0;

static float v_manual=0;
static uint32_t v_manual_deadline=0;
static float zv_target=0, zv_now=0;

// Two speed profiles. 'slow' is for bring-up: everything crawls, you have all
// the time in the world to hit stop, and a wiring mistake bumps the end of the
// rail instead of hitting it. 'fast' is what balancing actually requires.
void profileSlow() {
  p_vmax = 0.05f; p_vman = 0.02f; p_amax_s = 0.5f; p_amax_b = 1.0f;
  p_zvmax = 2.0f; p_zamax = 20.0f;
}
void profileFast() {
  // Preserve the previous 20T linear fast-profile limit after the 60T swap.
  p_vmax = 0.72f; p_vman = 0.15f; p_amax_s = 9.0f; p_amax_b = 18.0f;
  p_zvmax = 15.0f; p_zamax = 120.0f;
}

