rbafna6507/cartpole_inverted_pendulum/cartpole_esp32/cartpole_esp32.ino
// Exact pole placement. With a = -(K1*th + K2*thd + K3*x + K4*v) the closed
// loop characteristic polynomial of this plant is
//   s^4 + (K4 - K2/L)s^3 + (K3 - g/L - K1/L)s^2 - (g*K4/L)s - (g*K3/L)
// Matching that to (s^2+2*z*w*s+w^2)(s-pc1)(s-pc2) inverts in closed form.
void computeGains() {
  float b1 = 2.0f*p_pz*p_pw, b0 = p_pw*p_pw;
  float c1 = -(p_pc1 + p_pc2), c0 = p_pc1*p_pc2;
  float a3 = b1 + c1;
  float a2 = b0 + b1*c1 + c0;
  float a1 = b1*c0 + b0*c1;
  float a0 = b0*c0;
  const float L = p_leff, g = GRAV;
  K3 = -a0*L/g;
  K4 = -a1*L/g;
  K1 = L*K3 - g - L*a2;
  K2 = L*(K4 - a3);
  // K3 and K4 come out NEGATIVE and that is correct: to bring the cart back to
  // centre you must first accelerate AWAY from centre to tip the pole inward.
  // The system is non-minimum phase. "Fixing" those signs guarantees a fall.
}

// Alpha-beta tracking differentiator. Differencing a 12-bit encoder at 1 kHz
// would give ~1.5 rad/s of quantisation hash; this smooths it and handles the
// +-pi wrap without a glitch.
void estimate(float theta_meas) {
  float w = 2.0f*(float)M_PI*p_bw;
  float err = wrapPi(theta_meas - th_hat);
  th_hat  = wrapPi(th_hat + (thd_hat + 2.0f*w*err)*DT);
  thd_hat += w*w*err*DT;
  th = theta_meas;
  thd = thd_hat;
}

float balanceAccel() { return -(K1*th + K2*thd + K3*xc + K4*vc); }

// Energy shaping (Astrom-Furuta). With E = 0.5*thd^2 + (g/L)cos(th),
// dE/dt = -(a/L)*thd*cos(th), so pumping toward upright means
//   a = k*(E - E_up)*sign(thd*cos(th))
float swingAccel() {
  float Eup = GRAV/p_leff;
  float E   = 0.5f*thd*thd + Eup*cosf(th);
  energy_n  = E/Eup;                        // 1.0 at the top, -1.0 hanging
  float dE  = E - Eup;

  float s = thd*cosf(th);                   // hold sign through the deadband,
  if      (s >  0.05f) swing_sign =  1;     // otherwise it chatters at thd=0
  else if (s < -0.05f) swing_sign = -1;

  float a = p_ke*dE*(float)swing_sign;

  if (fabsf(thd) < 0.08f && fabsf(dE) > 1.0f) {   // dead start: nothing to
    stall_ms += 1000/CTRL_HZ;                     // take the sign from
    if (stall_ms > 250) a = (float)swing_sign*p_amax_s;
    if (stall_ms > 330) { stall_ms = 0; swing_sign = -swing_sign; }
  } else stall_ms = 0;

  a += -(p_kpx*xc + p_kdx*vc);
  return constrain(a, -p_amax_s, p_amax_s);
}

void eStop() {
  mode = M_IDLE;
  v_manual = 0; vc = 0; acc_cmd = 0; zv_target = 0; zv_now = 0;
  for (int i=0;i<N_AX;i++) ax_inc[i] = 0;
  // deliberately NOT de-energizing: the ball screws back-drive and the rail
  // would sink. Use 'off' for that, on purpose.
}

void controlTask(void *) {
  TickType_t wake = xTaskGetTickCount();
  for (;;) {
    vTaskDelayUntil(&wake, pdMS_TO_TICKS(1000/CTRL_HZ));
    uint32_t t_start = micros();

    encUpdate();

    // Serve bus requests here, where we already own Wire.
    if (req_diag) { req_diag = false; encDiagRead(); diag_done = true; }
    if (req_zero) {
      req_zero = false; zeroing = true;
      zero_stable = 0; zero_prev = enc_ticks; zero_t0 = millis();
    }
    if (zeroing) {
      if (labs(enc_ticks - zero_prev) <= 2) zero_stable++; else zero_stable = 0;
      zero_prev = enc_ticks;
      if (zero_stable >= 400 || millis() - zero_t0 > 15000) {
        enc_zero = enc_ticks; th_hat = encTheta(); thd_hat = 0;
        zeroing = false; zero_done = true;
      }
    }

    estimate(encTheta());
    xc = (ax_pos[AX_CART] - home_steps) / CART_STEPS_PER_M;
    z_mm = (ax_pos[AX_Z1] - zhome_steps) / Z_STEPS_PER_MM;

    float rail_hard = p_rail - 0.01f, rail_soft = p_rail - 0.05f;
    if (mode != M_IDLE && mode != M_FAULT && fabsf(xc) > rail_hard) {
      Serial.println(F("! rail limit -> FAULT"));
      mode = M_FAULT; eStop(); mode = M_FAULT;
    }

    float a = 0.0f;
    switch (mode) {
      case M_MANUAL:
        if (millis() > v_manual_deadline) v_manual = 0;   // key-release watchdog
        {
          // Ramp, don't jump. A dead-stop step to 0.15 m/s is 12,000 steps/s
          // at 1/16, which is ~750 full steps/s - well past what a NEMA 17
          // will start into from rest with the rotor and cart inertia hanging
          // off it. It would just buzz and slip, and the position count would
          // silently drift away from reality.
          float dv = p_amax_b*DT;
          if      (vc < v_manual - dv) vc += dv;
          else if (vc > v_manual + dv) vc -= dv;
          else                         vc  = v_manual;
        }
        if (xc >  rail_soft && vc > 0) vc = 0;
        if (xc < -rail_soft && vc < 0) vc = 0;
        axSetRate(AX_CART, vc*CART_STEPS_PER_M, CART_INVERT);
        goto zaxis;

      case M_SWINGUP:
        a = swingAccel();
        if (fabsf(th) < p_catch_a && fabsf(thd) < p_catch_r) {
          mode = M_BALANCE; Serial.println(F("# caught -> BALANCE"));
        }
        break;

      case M_BALANCE: {
        float Eup = GRAV/p_leff;
        energy_n = (0.5f*thd*thd + Eup*cosf(th))/Eup;
        a = constrain(balanceAccel(), -p_amax_b, p_amax_b);
        if (fabsf(th) > p_giveup) {
          mode = M_SWINGUP; Serial.println(F("# lost it -> SWINGUP"));
        }
        break;
      }

      default:                                   // IDLE / FAULT
        vc = 0; acc_cmd = 0;
        axSetRate(AX_CART, 0, CART_INVERT);
        goto zaxis;
    }

    if (fabsf(xc) > rail_soft && xc*vc > 0.0f)   // soft rail overrides all
      a = -(xc > 0 ? 1.0f : -1.0f)*p_amax_b;

    acc_cmd = a;
    vc += a*DT;
    vc = constrain(vc, -p_vmax, p_vmax);
    if (xc >  rail_hard && vc > 0) vc = 0;       // anti-windup at the wall
    if (xc < -rail_hard && vc < 0) vc = 0;
    axSetRate(AX_CART, vc*CART_STEPS_PER_M, CART_INVERT);

  zaxis:
    {   // both screws get the identical command so the rail cannot rack
      float dv = p_zamax*DT;
      if      (zv_now < zv_target - dv) zv_now += dv;
      else if (zv_now > zv_target + dv) zv_now -= dv;
      else                              zv_now  = zv_target;
      if (z_mm >= p_ztravel && zv_now > 0) zv_now = 0;
      if (z_mm <= 0.0f      && zv_now < 0) zv_now = 0;
      float zr = zv_now*Z_STEPS_PER_MM;
      axSetRate(AX_Z1, zr, Z_INVERT);
      axSetRate(AX_Z2, zr, Z_INVERT);
    }

    loop_us = micros() - t_start;
  }
}

// ============================= PROTOCOL =====================================
static uint16_t tele_hz = 100;

void printParams() {
  for (int i=0;i<N_PARAMS;i++) Serial.printf("= %s %.5f\n", PARAMS[i].name, *PARAMS[i].ptr);
  Serial.printf("= cart_steps_per_m %.2f\n", CART_STEPS_PER_M);
  Serial.printf("= z_steps_per_mm %.2f\n", Z_STEPS_PER_MM);
}

