rbafna6507/cartpole_inverted_pendulum/cartpole_esp32/cartpole_esp32.ino
void handleLine(char *line) {
  char *cmd = strtok(line, " \t");
  if (!cmd) return;
  char *a1 = strtok(nullptr, " \t");

  if      (!strcmp(cmd,"stop"))  { eStop(); Serial.println(F("# STOP")); }
  else if (!strcmp(cmd,"off"))   { eStop(); energize(false);
                                   Serial.println(F("# de-energized - hold the rail")); }
  else if (!strcmp(cmd,"on"))    { energize(true); Serial.println(F("# energized")); }
  else if (!strcmp(cmd,"auto"))  { energize(true); vc=0; swing_sign=1;
                                   mode=M_SWINGUP; Serial.println(F("# SWINGUP")); }
  else if (!strcmp(cmd,"bal"))   { energize(true); vc=0; mode=M_BALANCE;
                                   Serial.println(F("# BALANCE")); }
  else if (!strcmp(cmd,"manual")){ energize(true); vc=0; v_manual=0;
                                   mode=M_MANUAL; Serial.println(F("# MANUAL")); }
  else if (!strcmp(cmd,"v")) {
    if (mode != M_MANUAL) { energize(true); mode = M_MANUAL; }
    v_manual = a1 ? constrain(atof(a1), -p_vmax, p_vmax) : 0;
    v_manual_deadline = millis() + MANUAL_TIMEOUT_MS;
  }
  else if (!strcmp(cmd,"zv"))    { energize(true);
                                   zv_target = a1 ? constrain(atof(a1),-p_zvmax,p_zvmax) : 0; }
  else if (!strcmp(cmd,"zstop")) { zv_target = 0; }
  else if (!strcmp(cmd,"slow"))  { eStop(); profileSlow();
                                   Serial.println(F("# SLOW profile - bring-up only, will not balance")); }
  else if (!strcmp(cmd,"fast"))  { eStop(); profileFast();
                                   Serial.println(F("# FAST profile - full speed, keep clear")); }
  else if (!strcmp(cmd,"home"))  { home_steps = ax_pos[AX_CART];
                                   Serial.println(F("# x = 0 here")); }
  else if (!strcmp(cmd,"zhome")) { zhome_steps = ax_pos[AX_Z1];
                                   Serial.println(F("# z = 0 here")); }
  else if (!strcmp(cmd,"zero"))  { eStop(); req_zero = true;
                                   Serial.println(F("# zeroing: hold the pendulum still, hanging...")); }
  else if (!strcmp(cmd,"mag"))   { req_diag = true; }
  else if (!strcmp(cmd,"rate"))  { tele_hz = a1 ? atoi(a1) : 0;
                                   Serial.printf("# telemetry %u Hz\n", tele_hz); }
  else if (!strcmp(cmd,"params")){ printParams(); }
  else if (!strcmp(cmd,"get")) {
    for (int i=0;i<N_PARAMS;i++)
      if (a1 && !strcmp(a1,PARAMS[i].name)) { Serial.printf("= %s %.5f\n",PARAMS[i].name,*PARAMS[i].ptr); return; }
    Serial.println(F("! no such param"));
  }
  else if (!strcmp(cmd,"set")) {
    char *a2 = strtok(nullptr," \t");
    if (!a1 || !a2) { Serial.println(F("! usage: set <key> <value>")); return; }
    for (int i=0;i<N_PARAMS;i++) if (!strcmp(a1,PARAMS[i].name)) {
      float want = atof(a2);
      // No clamp - your machine, your call. But say so, because above the
      // ceiling the pulse generator saturates while the controller keeps
      // integrating vc to the number you asked for, and the velocity feedback
      // term stops describing the real cart.
      if (PARAMS[i].ptr == &p_vmax && want > VMAX_CEIL)
        Serial.printf("! note: %.2f is past the %.2f m/s pulse ceiling - "
                      "steps saturate, vc will read high. Raise ISR_HZ.\n",
                      want, VMAX_CEIL);
      *PARAMS[i].ptr = want;
      if (PARAMS[i].recalc) computeGains();
      Serial.printf("= %s %.5f\n", PARAMS[i].name, *PARAMS[i].ptr);
      return;
    }
    Serial.println(F("! no such param"));
  }
  else if (!strcmp(cmd,"stat")) {
    Serial.printf("# mode=%s energized=%d theta=%+.3f thd=%+.2f x=%+.4f v=%+.3f "
                  "z=%.1fmm agc=%d i2c_err=%lu loop=%luus\n",
                  MODE_NAME[mode], (int)g_energized, th, thd, xc, vc, z_mm,
                  enc_agc, (unsigned long)enc_errors, (unsigned long)loop_us);
    float mm_per_rev = PULLEY_TEETH * BELT_PITCH_MM;
    Serial.printf("# motor %.0f rpm now, %.0f rpm at vmax, %.0f rpm at ceiling "
                  "(%.0f steps/s max)\n",
                  fabsf(vc)*60000.0f/mm_per_rev, p_vmax*60000.0f/mm_per_rev,
                  VMAX_CEIL*60000.0f/mm_per_rev, ISR_HZ*0.5f);
    Serial.printf("# K = [%.3f %.3f %.3f %.3f]\n", K1,K2,K3,K4);
  }
  else if (!strcmp(cmd,"help")) {
    Serial.println(F("# auto bal manual v<mps> zv<mmps> zstop stop off on"));
    Serial.println(F("# slow fast home zhome zero mag rate<hz> set get params stat"));
  }
  else Serial.println(F("! unknown command (try 'help')"));
}

void pollSerial() {
  static char buf[96]; static uint8_t n = 0;
  while (Serial.available()) {
    char c = Serial.read();
    if (c == '\n' || c == '\r') {
      if (n) { buf[n] = 0; handleLine(buf); n = 0; }
    } else if (n < sizeof(buf)-1) buf[n++] = c;
  }
}

void emitTelemetry() {
  Serial.printf("T %lu %d %.4f %.3f %.5f %.4f %.3f %.4f %.2f %.2f %d %lu\n",
                (unsigned long)millis(), (int)mode, th, thd, xc, vc, acc_cmd,
                energy_n, z_mm, z_mm, enc_agc, (unsigned long)loop_us);
}

// ============================== SETUP =======================================
void setup() {
  Serial.begin(921600);
  Serial.setTxBufferSize(2048);
  delay(300);
  Serial.println(F("\n# ESP32 cart-pole v2"));

  // I2C comes up FIRST, while nothing else is competing for the CPU. Bringing
  // the 120 kHz step interrupt up first meant the very first bus transactions
  // happened under ~20% interrupt load, on a 5 ms timeout, with no retries.
  Wire.begin(PIN_SDA, PIN_SCL, I2C_HZ);
  Wire.setTimeOut(50);
  delay(50);

  Serial.println(F("# scanning i2c..."));
  for (uint8_t a = 1; a < 127; a++) {
    Wire.beginTransmission(a);
    if (Wire.endTransmission() == 0)
      Serial.printf("#   device at 0x%02X%s\n", a,
                    a == AS5600_ADDR ? "  <- AS5600" :
                    a == 0x06        ? "  <- MT6701, different chip" : "");
    delay(1);
  }

  encDiagRead();
  enc_last_raw = encReadRaw();
  enc_ok = (enc_last_raw >= 0);
  if (!enc_ok) { Serial.println(F("! encoder not answering - check SDA=21 SCL=22, "
                                  "3V3, and DIR tied to GND")); enc_last_raw = 0; }
  encPrintMagnet();
  if (as5600FastFilter()) Serial.println(F("# AS5600 slow filter -> 2x (0.29 ms lag)"));
  else                    Serial.println(F("! AS5600 CONF write failed"));
  enc_ticks = 0;

  steppersInit();

