rbafna6507/cartpole_inverted_pendulum/cartpole_esp32/cartpole_esp32.ino
  computeGains();
  Serial.printf("# cart %.1f steps/mm (1/%d), Z %.1f steps/mm\n",
                CART_STEPS_PER_M/1000.0f, CART_MICROSTEPS, Z_STEPS_PER_MM);
  Serial.printf("# cart speed ceiling %.2f m/s\n", VMAX_CEIL);
  delay(300);
  encZeroBlocking();
  th_hat = encTheta();
  home_steps = ax_pos[AX_CART];
  zhome_steps = ax_pos[AX_Z1];
  Serial.printf("# K = [%.3f %.3f %.3f %.3f]\n", K1,K2,K3,K4);
  Serial.println(F("# SLOW profile active. 'fast' when you want to balance."));
  Serial.println(F("# ready. 'help' for commands."));

  xTaskCreatePinnedToCore(controlTask, "ctrl", 4096, nullptr, 5, nullptr, 1);
}

void loop() {
  pollSerial();

  if (diag_done) { diag_done = false; encPrintMagnet(); }
  if (zero_done) { zero_done = false;
                   Serial.printf("# encoder zeroed, theta = %.3f rad\n", th); }
  static uint32_t last = 0;
  if (tele_hz) {
    uint32_t period = 1000000UL / tele_hz;
    if (micros() - last >= period) { last = micros(); emitTelemetry(); }
  }
  delayMicroseconds(200);
}

// ============================================================================
//  CALIBRATION, in order. Do not skip 1 and 2.
//
//  1. STEPS/M must be exact. 'manual', then 'home', drive the cart with the
//     host tool, and compare reported x against a ruler. If they disagree,
//     your pulley or microstep constants are wrong - fix the constants, don't
//     fudge a scale factor.
//
//  2. L_EFF. Let the pendulum hang, give it a small push, time 10 swings.
//     T = 2*pi*sqrt(L_EFF/g), so L_EFF = g*(T/(2*pi))^2. Every gain in the
//     balancer is derived from this number, so measure it rather than guess.
//     Then:  set leff <value>
//
//  3. Direction checks. 'manual' and drive right: theta must go POSITIVE when
//     you tilt the pole top in the direction the cart moved for positive v.
//     If not, flip ENC_INVERT (or CART_INVERT) and reflash.
//
//  4. Balance first, swing-up second. Hold the pole upright, send 'bal'. It
//     should fight you. Oscillating fast -> lower pw. Drifting into the rail
//     -> make pc1/pc2 more negative. Buzzing -> lower bw.
//
//  5. Then 'auto'. Never builds enough energy -> raise amax_s or lower kpx
//     (the centring term steals energy). Flies past the top -> lower ke, or
//     widen catch_r.
//
//  IF SWING-UP STALLS AT A FIXED AMPLITUDE, suspect the velocity ceiling
//  before the gains. The energy pump does work at a rate -(a/L)*thd*cos(th),
//  so the moment the cart saturates at vmax the acceleration goes to zero and
//  pumping stops dead for the rest of that half-swing. Watch 'v' in the
//  dashboard: if it is flat-topped at +-vmax for long stretches, you are
//  speed-limited. The 60T conversion preserves the prior linear speed limits.
//
//  LOST STEPS LOOK EXACTLY LIKE BAD TUNING. After any crash, check that the
//  reported x = 0 is still the physical centre. If it has drifted, you are
//  losing steps: lower amax/vmax, raise Vref, or raise the motor supply
//  voltage. Note the rotor itself is not free - an illustrative 87 g.cm^2 through a 19.10 mm
//  pitch radius reflects to ~0.024 kg of apparent cart mass. Actual inertia
//  has not been measured.
// ============================================================================
